[general]
enname=English
name=English
[translations]
Sourcecode=Sourcecode
Application_name=Application name
Installation_folder=Installation folder
Author=Author
Email=Email
Application_version=Application version
Update_Version=Update Version
Advanced=Advanced
Files=Files
Folders=Folders
Exe=Exe
Content=Content
None=None
Compile_scripts=Compile scripts
Remove_Entry=Remove Entry
Choose_icon=Choose icon
Generate_installation_file=Generate installation file
Keep_temporary_files=Keep temporary files
Close=Close
Default_values=Default values
Language=Language
Help=Help
About=About
Settings=Settings
Attention=Attention
When_you_change_the_language,_Base_Frame_needs_to_be_restarted._All_settings_will_be_lost=When you change the language, Base Frame needs to be restarted. All settings will be lost
Error=Error
The_template_files_could_not_be_loaded._Without_them_Base_Frame_does_not_work!=The template files could not be loaded. Without them Base Frame does not work!
Select_sourcecode=Select sourcecode
AutoHotKey_scripts=AutoHotKey scripts
Update_URL=Update URL
Update_Checker_for_%1%=Update Checker for %1%
Downloading_the_update_informations=Downloading the update informations
An_error_occured_while_getting_the_update_informations=An error occured while getting the update informations
Maybe_you_don't_have_internet_connetion_or_the_link_that_is_stored_in_the_application_is_corrupt=Maybe you don't have internet connetion or the link that is stored in the application is corrupt
There_might_be_an_update_available_anyway=There might be an update available anyway
Do_you_want_to_download_it?=Do you want to download it?
Installed_version=Installed version
Available_version=Available version
Downloading_new_version=Downloading new version
Download_successfull!=Download successfull!
Starting_installation=Starting installation
Open_webpage=Open webpage
Download_failed=Download failed
Maybe_you_should_try_it_later=Maybe you should try it later
The_update_information_does_not_contain_informations_about_where_to_get_the_new_version.=The update information does not contain informations about where to get the new version.
Download_of_the_update_is_not_possible=Download of the update is not possible
No_new_version_available.=No new version available.
Current_version=Current version
A_new_version_is_avialable!=A new version is avialable!
New_sourcecode=New sourcecode
Changelog=Changelog
OK=OK
Delete_icon=Delete icon
In_progress=In progress
Compile_%1%=Compile %1%
Icon=Icon
Select_icon=Select icon
No_icon=No icon
Choose_icon_file_for_the_script_%1%=Choose icon file for the script %1%
Icons=Icons
The_compiler_needs_very_long_to_compile_%1%.=The compiler needs very long to compile %1%.
Finished=Finished
Base_Frame_was_appended_to_%1%.=Base Frame was appended to %1%.
Do_you_want_to_create_a_shortcut_for_faster_compilation?=Do you want to create a shortcut for faster compilation?
Compile_with_Base_Frame=Compile with Base Frame
Enter_the_default_values_for_new_projects=Enter the default values for new projects
Cancel=Cancel
Set_default_values=Set default values
Add_entry=Add entry
Advanced_informations=Advanced informations
You_are_about_to_open_a_new_sourcecode_of_another_Application.=You are about to open a new sourcecode of another Application.
All_your_current_settings_of_currently_opened_application_will_be_lost.=All your current settings of currently opened application will be lost.
Base_Frame_needs_to_be_restarted.=Base Frame needs to be restarted.
Do_you_want_to_continue?=Do you want to continue?
Please_choose_an_AutoHotKey_script=Please choose an AutoHotKey script
Select_file_to_add=Select file to add
The_files_must_be_inside_the_path_of_the_sourcecode=The files must be inside the path of the sourcecode
Information=Information
The_sourcecode_script_cannot_be_added_to_the_selection=The sourcecode script cannot be added to the selection
The_file_%1%_could_not_be_added_because_it_is_the_sourcecode_script=The file %1% could not be added because it is the sourcecode script
The_file_%1%_could_not_be_added_because_it_is_the_Default_Licence_file_of_the_installer=The file %1% could not be added because it is the default licence file of the installer
Select_a_folder_to_add=Select a folder to add
The_folder_must_be_a_subfolder_of_the_sourcecode_path=The folder must be a subfolder of the sourcecode path
Add_Scripts_that_should_compile=Add scripts that should be compiled
The_files_must_be_inside_the_folder_of_the_sourcecode_or_a_subfolder=The files must be inside the folder of the sourcecode or a subfolder
All_files_that_are_inside_this_folder_will_also_be_removed_from_the_selection=All files that are inside this folder will also be removed from the selection
The_file_belongs_to_Base_Frame_and_cannot_be_removed=The file belongs to Base Frame and cannot be removed
No_help_file_was_found=No help file was found
Open=Open
Base_Frame=Base Frame
Important_values=Important values
Following_values_are_needed_for_the_project=Following values are needed for the project
Application_version_to_show=Application version to show
Precise_application_version=Precise application version
Create_new_project=Create new project
Start_menu_folder=Start menu folder
Application_ID=Application ID
Create_installation_file=Create installation file
Included_files=Included files
Updater=Updater
Include_updater=Include updater
Automatically_check_for_updates_on_every_startup_of_main_application=Automatically check for updates on every startup of main application
Do_not_automatically_check_for_updates=Do not automatically check for updates
File_path=File path
Section=Section
Key=Key
optional=optional
Only_if_following_entry_in_an_ini_file_contains_1=Only if following entry in an ini file contains 1
License=License
Select_license=Select license
Installer_language=Installer language
Select_installer_language=Select installer language
Include_following_license=Include following license
Use_own_license_text=Use own license text
Select_A_License_File=Select A License File
Behaviour=Behaviour
URL=URL
needed=needed
Include_update_checker=Include update checker
Installation_type=Installation type
Only_allow_normal_installation=Only allow normal installation
Only_allow_portable_installation=Only allow portable installation
Allow_both=Allow both
Only_extract_files_to_a_folder_(portable_installation)=Only extract files to a folder (portable installation)
Download_update_informations=Download update informations
Ini_file_with_update_informations=Ini file with update informations
Create_ini_file_after_generation=Create ini file after generation
Installer_URL=Installer URL
Destination_path_for_ini_file=Destination path for ini file
Download_URI_for_update_informations=Download URI for update informations
Select_destination_of_file_with_update_informations=Select destination of file with update informations
Select_destination_file_with_update_informations=Select destination file with update informations
Download_URL_for_update_informations=Download URL for update informations
File_containing_changelog=File containing changelog
Select_a_file_which_contains_the_changelog=Select a file which contains the changelog
The_file_does_not_exist._A_new_one_will_be_created.=The file does not exist. A new one will be created.
You_can_edit_the_changelog_here=You can edit the changelog here
Save_changelog_now=Save changelog now
The_file_must_be_in_a_subfolder_of_the_sourcecode_path=The file must be in a subfolder of the sourcecode path
Project_website=Project website
Installer=Installer
Update_checker=Update checker
Download_URL_for_update_information=Download URL for update information
Ini_file_with_update_information=Ini file with update information
Advanced_settings=Advanced settings
Select_destination_file_with_update_information=Select destination file with update information
